# Series

In [3]:
import numpy as np
import pandas as pd

In [11]:
# similar to numpy arrays

labels = ['a', 'b', 'c']
my_data = [10, 20, 30]
arr = np.array(my_data)
d = {'a': 10,
     'b': 20,
     'c': 30}

In [5]:
labels

['a', 'b', 'c']

In [6]:
my_data

[10, 20, 30]

In [7]:
d

{'a': 10, 'b': 20, 'c': 30}

In [8]:
pd.Series(data = my_data)

0    10
1    20
2    30
dtype: int64

In [9]:
# produces a labeled (pre-specified) index data series
pd.Series(data = my_data, index = labels)

a    10
b    20
c    30
dtype: int64

In [12]:
# passing in a numpy array
pd.Series(arr)

0    10
1    20
2    30
dtype: int64

In [13]:
# passing in a dictionary
pd.Series(d)

a    10
b    20
c    30
dtype: int64

In [14]:
# can pass in string data as well
pd.Series(data = labels)

0    a
1    b
2    c
dtype: object

In [15]:
sr1 = pd.Series([1, 2, 3, 4], ["USA", "Germany", "Lithuania", "UK"])
sr1

USA          1
Germany      2
Lithuania    3
UK           4
dtype: int64

In [16]:
sr2 = pd.Series([1, 2, 9, 4], ["USA", "Germany", "Italy", "UK"])
sr2

USA        1
Germany    2
Italy      9
UK         4
dtype: int64

In [17]:
# can grab data by specifying the index
sr1["Lithuania"]

3

In [18]:
sr1 + sr2

Germany      4.0
Italy        NaN
Lithuania    NaN
UK           8.0
USA          2.0
dtype: float64

# Data Frames

In [21]:
from numpy.random import randn as randNorm
np.random.seed(101)

In [22]:
df = pd.DataFrame(randNorm(5, 4), 
                  ["A", "B", "C", "D", "E"], # row names
                  ["W", "X", "Y", "Z"]) # column names
df 
# data frame is a collection of series with common indexes

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [23]:
df["W"]

A    2.706850
B    0.651118
C   -2.018168
D    0.188695
E    0.190794
Name: W, dtype: float64

In [24]:
type(df["W"])

pandas.core.series.Series

In [25]:
df.W

A    2.706850
B    0.651118
C   -2.018168
D    0.188695
E    0.190794
Name: W, dtype: float64

In [26]:
df[["W", "Z"]] # to retrieve 2 columns

          W         Z
A  2.706850  0.503826
B  0.651118  0.605965
C -2.018168 -0.589001
D  0.188695  0.955057
E  0.190794  0.683509

In [27]:
# to create a new column
df["new"] = df["W"] + df["Y"]
df

          W         X         Y         Z       new
A  2.706850  0.628133  0.907969  0.503826  3.614819
B  0.651118 -0.319318 -0.848077  0.605965 -0.196959
C -2.018168  0.740122  0.528813 -0.589001 -1.489355
D  0.188695 -0.758872 -0.933237  0.955057 -0.744542
E  0.190794  1.978757  2.605967  0.683509  2.796762

In [31]:
# to remove a column
    # by default, axis = 0, which means rows; set = 1 to specify column 
    # inplace must be set true to permanently remove (otherwise will retain)
df.drop("new", axis = 1, inplace=True)
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [33]:
df.drop("E")

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [35]:
df.shape

(5, 4)

In [36]:
# selecting rows
    # loc for location
df.loc["A"] # pass in index label

W    2.706850
X    0.628133
Y    0.907969
Z    0.503826
Name: A, dtype: float64

In [37]:
df.iloc[2] # pass in index number

W   -2.018168
X    0.740122
Y    0.528813
Z   -0.589001
Name: C, dtype: float64

In [39]:
df.loc["B", "Y"]

-0.8480769834036315

In [40]:
df.loc[["A", "B"], ["W", "Y"]] # subset of data frame - in separate lists, specify which rows & which columns you want

          W         Y
A  2.706850  0.907969
B  0.651118 -0.848077

In [41]:
df > 0

       W      X      Y      Z
A   True   True   True   True
B   True  False  False   True
C  False   True   True  False
D   True  False  False   True
E   True   True   True   True

In [42]:
booldf = df > 0 
booldf

       W      X      Y      Z
A   True   True   True   True
B   True  False  False   True
C  False   True   True  False
D   True  False  False   True
E   True   True   True   True

In [43]:
df["W"] > 0

A     True
B     True
C    False
D     True
E     True
Name: W, dtype: bool

In [44]:
# will only return rows of df where values of row "W" > 0
df[df["W"]>0]

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [45]:
df[df["Z"]<0]

          W         X         Y         Z
C -2.018168  0.740122  0.528813 -0.589001

In [46]:
df[df["W"]>0]["X"]

A    0.628133
B   -0.319318
D   -0.758872
E    1.978757
Name: X, dtype: float64

In [49]:
df[df["W"]>0][["X", "Y"]]

          X         Y
A  0.628133  0.907969
B -0.319318 -0.848077
D -0.758872 -0.933237
E  1.978757  2.605967

In [50]:
df[(df["W"]>0) & (df["Y"]>1)] # for multiple conditions, use & | (not and/or)

          W         X         Y         Z
E  0.190794  1.978757  2.605967  0.683509

In [51]:
df.reset_index() # to reset index into numerical 0-onwards

  index         W         X         Y         Z
0     A  2.706850  0.628133  0.907969  0.503826
1     B  0.651118 -0.319318 -0.848077  0.605965
2     C -2.018168  0.740122  0.528813 -0.589001
3     D  0.188695 -0.758872 -0.933237  0.955057
4     E  0.190794  1.978757  2.605967  0.683509

In [53]:
newIndex = "CA NY WY OE CO".split()
newIndex

['CA', 'NY', 'WY', 'OE', 'CO']

In [54]:
df["States"] = newIndex

In [55]:
df

          W         X         Y         Z States
A  2.706850  0.628133  0.907969  0.503826     CA
B  0.651118 -0.319318 -0.848077  0.605965     NY
C -2.018168  0.740122  0.528813 -0.589001     WY
D  0.188695 -0.758872 -0.933237  0.955057     OE
E  0.190794  1.978757  2.605967  0.683509     CO

In [ ]:
df.set_index("States") # to set a column as your new index

In [59]:
outside = ["G1", "G1", "G1", "G2", "G2", "G2"]
inside = [1, 2, 3, 1, 2, 3]
# will create a list of tuple pairs - eg G1 1 ; G1 2 ; G1 3, etc.
hier_index = list(zip(outside, inside))
# creates a multi index - eg levels G1 & G2 ; levels 1, 2, 3 ; labels 
hier_index = pd.MultiIndex.from_tuples(hier_index)

In [60]:
hier_index

MultiIndex([('G1', 1),
            ('G1', 2),
            ('G1', 3),
            ('G2', 1),
            ('G2', 2),
            ('G2', 3)],
           )

In [63]:
df = pd.DataFrame(randNorm(6, 2), hier_index, ["A", "B"])
df

             A         B
G1 1 -0.497104 -0.754070
   2 -0.943406  0.484752
   3 -0.116773  1.901755
G2 1  0.238127  1.996652
   2 -0.993263  0.196800
   3 -1.136645  0.000366

In [64]:
df.loc["G1"] # returns all rows & columns for label G1

          A         B
1 -0.497104 -0.754070
2 -0.943406  0.484752
3 -0.116773  1.901755

In [67]:
df.loc["G1"].loc[1] # return both columns for row [1]

A   -0.497104
B   -0.754070
Name: 1, dtype: float64

In [70]:
df.index.names = ["Groups", "Num"] # gives names to Group & Number indexes
df

                   A         B
Groups Num
G1     1   -0.497104 -0.754070
       2   -0.943406  0.484752
       3   -0.116773  1.901755
G2     1    0.238127  1.996652
       2   -0.993263  0.196800
       3   -1.136645  0.000366

In [71]:
df.loc["G2"]

            A         B
Num
1    0.238127  1.996652
2   -0.993263  0.196800
3   -1.136645  0.000366

In [72]:
df.loc["G2"].loc[2]["B"] # grabbing a singular value

0.19679950499134005

In [73]:
df.loc["G1"].loc[3]["A"]

-0.11677331646707445

In [74]:
# cross-section method
    # specify what value from which level 
    # will return all values (in df) for that level 
df.xs(1, level = "Num")

               A         B
Groups
G1     -0.497104 -0.754070
G2      0.238127  1.996652

# Missing Data

In [78]:
df = {"A" : [1, 2, np.nan],
     "B" : [5, np.nan, np.nan],
     "C" : [1, 2, 3]}
df = pd.DataFrame(df)
df

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2
2  NaN  NaN  3

In [79]:
df.dropna() # will drop rows where nan

     A    B  C
0  1.0  5.0  1

In [80]:
df.dropna(axis = 1) # will drop columns where nan

   C
0  1
1  2
2  3

In [81]:
df.dropna(thresh=2) # setting a threshold for the number of nan for dropping rows

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2

In [85]:
df["A"].fillna(value = df["A"].mean()) # filling with the mean value of column A

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2
2  NaN  NaN  3

# Group By

allows to group rows together based of a column (eg all ID = 1, all ID = 2) and perform an aggregate fuction on them

In [90]:
data = {'Company':['GOOG','GOOG','MSFT','MSFT','FB','FB'],
       'Person':['Sam','Charlie','Amy','Vanessa','Carl','Sarah'],
       'Sales':[200,120,340,124,243,350]}
df = pd.DataFrame(data)
df

  Company   Person  Sales
0    GOOG      Sam    200
1    GOOG  Charlie    120
2    MSFT      Amy    340
3    MSFT  Vanessa    124
4      FB     Carl    243
5      FB    Sarah    350

In [99]:
byComp = df.groupby("Company")
byComp

In [105]:
byComp.sum()

             Person  Sales
Company
FB        CarlSarah    593
GOOG     SamCharlie    320
MSFT     AmyVanessa    464

In [106]:
byComp.sum().loc["FB"]

Person    CarlSarah
Sales           593
Name: FB, dtype: object

In [107]:
df.groupby("Company").count()

         Person  Sales
Company
FB            2      2
GOOG          2      2
MSFT          2      2

In [108]:
df.groupby("Company").describe() # will return all descriptive stats for that group

        Sales
        count   mean         std    min     25%    50%     75%    max
Company
FB        2.0  296.5   75.660426  243.0  269.75  296.5  323.25  350.0
GOOG      2.0  160.0   56.568542  120.0  140.00  160.0  180.00  200.0
MSFT      2.0  232.0  152.735065  124.0  178.00  232.0  286.00  340.0

In [110]:
df.groupby("Company").describe().transpose()["FB"] # just for one company

Sales  count      2.000000
       mean     296.500000
       std       75.660426
       min      243.000000
       25%      269.750000
       50%      296.500000
       75%      323.250000
       max      350.000000
Name: FB, dtype: float64

# Merging Joining and Concatenating

In [111]:
df1 = pd.DataFrame({'A': ['A0', 'A1', 'A2', 'A3'],
                        'B': ['B0', 'B1', 'B2', 'B3'],
                        'C': ['C0', 'C1', 'C2', 'C3'],
                        'D': ['D0', 'D1', 'D2', 'D3']},
                        index=[0, 1, 2, 3])

In [114]:
df1

    A   B   C   D
0  A0  B0  C0  D0
1  A1  B1  C1  D1
2  A2  B2  C2  D2
3  A3  B3  C3  D3

In [112]:
df2 = pd.DataFrame({'A': ['A4', 'A5', 'A6', 'A7'],
                        'B': ['B4', 'B5', 'B6', 'B7'],
                        'C': ['C4', 'C5', 'C6', 'C7'],
                        'D': ['D4', 'D5', 'D6', 'D7']},
                         index=[4, 5, 6, 7])

In [115]:
df2

    A   B   C   D
4  A4  B4  C4  D4
5  A5  B5  C5  D5
6  A6  B6  C6  D6
7  A7  B7  C7  D7

In [113]:
df3 = pd.DataFrame({'A': ['A8', 'A9', 'A10', 'A11'],
                        'B': ['B8', 'B9', 'B10', 'B11'],
                        'C': ['C8', 'C9', 'C10', 'C11'],
                        'D': ['D8', 'D9', 'D10', 'D11']},
                        index=[8, 9, 10, 11])

In [116]:
df3

      A    B    C    D
8    A8   B8   C8   D8
9    A9   B9   C9   D9
10  A10  B10  C10  D10
11  A11  B11  C11  D11

In [117]:
pd.concat([df1, df2, df3]) # concatinating multiple df into one 
# by default axis = 0, joining by rows

      A    B    C    D
0    A0   B0   C0   D0
1    A1   B1   C1   D1
2    A2   B2   C2   D2
3    A3   B3   C3   D3
4    A4   B4   C4   D4
5    A5   B5   C5   D5
6    A6   B6   C6   D6
7    A7   B7   C7   D7
8    A8   B8   C8   D8
9    A9   B9   C9   D9
10  A10  B10  C10  D10
11  A11  B11  C11  D11

In [118]:
left = pd.DataFrame({'key': ['K0', 'K1', 'K2', 'K3'],
                     'A': ['A0', 'A1', 'A2', 'A3'],
                     'B': ['B0', 'B1', 'B2', 'B3']})
   
right = pd.DataFrame({'key': ['K0', 'K1', 'K2', 'K3'],
                          'C': ['C0', 'C1', 'C2', 'C3'],
                          'D': ['D0', 'D1', 'D2', 'D3']})

In [119]:
left

  key   A   B
0  K0  A0  B0
1  K1  A1  B1
2  K2  A2  B2
3  K3  A3  B3

In [120]:
right

  key   C   D
0  K0  C0  D0
1  K1  C1  D1
2  K2  C2  D2
3  K3  C3  D3

In [121]:
pd.merge(left, right, how="inner", on="key") # merging based on key column
# there are different ways for merging - inner, outer, left, right

  key   A   B   C   D
0  K0  A0  B0  C0  D0
1  K1  A1  B1  C1  D1
2  K2  A2  B2  C2  D2
3  K3  A3  B3  C3  D3

In [124]:
left = pd.DataFrame({'A': ['A0', 'A1', 'A2'],
                     'B': ['B0', 'B1', 'B2']},
                      index=['K0', 'K1', 'K2']) 

right = pd.DataFrame({'C': ['C0', 'C2', 'C3'],
                    'D': ['D0', 'D2', 'D3']},
                      index=['K0', 'K2', 'K3'])

In [125]:
left

     A   B
K0  A0  B0
K1  A1  B1
K2  A2  B2

In [126]:
right

     C   D
K0  C0  D0
K2  C2  D2
K3  C3  D3

In [127]:
left.join(right) # by default will do an inner join
# join means - joining diffently indexed dataframes index

     A   B    C    D
K0  A0  B0   C0   D0
K1  A1  B1  NaN  NaN
K2  A2  B2   C2   D2

In [128]:
left.join(right, how = "outer")

      A    B    C    D
K0   A0   B0   C0   D0
K1   A1   B1  NaN  NaN
K2   A2   B2   C2   D2
K3  NaN  NaN   C3   D3

# Operations

In [129]:
df = pd.DataFrame({'col1':[1,2,3,4],
                   'col2':[444,555,666,444],
                   'col3':['abc','def','ghi','xyz']})
df.head()

   col1  col2 col3
0     1   444  abc
1     2   555  def
2     3   666  ghi
3     4   444  xyz

In [130]:
df["col2"].unique() # finding unique values in a column

array([444, 555, 666])

In [131]:
df["col2"].nunique() # returns the count of unique values

3

In [132]:
df["col2"].value_counts()

col2
444    2
555    1
666    1
Name: count, dtype: int64

In [133]:
df[df["col1"]>2] # all rows where col2 > 2

   col1  col2 col3
2     3   666  ghi
3     4   444  xyz

In [134]:
def times2(x):
    return x*2

In [136]:
# can apply custom functions on whole column  
df["col1"].apply(times2)

0    2
1    4
2    6
3    8
Name: col1, dtype: int64

In [138]:
df["col3"].apply(len)

0    3
1    3
2    3
3    3
Name: col3, dtype: int64

In [139]:
# or can be done w/ lambdas without explictely defining the function
df["col3"].apply(lambda x: x*2)

0    abcabc
1    defdef
2    ghighi
3    xyzxyz
Name: col3, dtype: object

In [140]:
# need to specify axis = 1 if you want ot drop columns 
df.drop("col1", axis = 1)

   col2 col3
0   444  abc
1   555  def
2   666  ghi
3   444  xyz

In [142]:
df.columns # wil return all column names

Index(['col1', 'col2', 'col3'], dtype='object')

In [143]:
df.sort_values("col2") # asc sorting by col2

   col1  col2 col3
0     1   444  abc
3     4   444  xyz
1     2   555  def
2     3   666  ghi

In [144]:
df.isnull()

    col1   col2   col3
0  False  False  False
1  False  False  False
2  False  False  False
3  False  False  False

# Pivot tables

In [146]:
data = {'A':['foo','foo','foo','bar','bar','bar'],
     'B':['one','one','two','two','one','one'],
       'C':['x','y','x','y','x','y'],
       'D':[1,3,2,5,4,1]}

df = pd.DataFrame(data)
df

     A    B  C  D
0  foo  one  x  1
1  foo  one  y  3
2  foo  two  x  2
3  bar  two  y  5
4  bar  one  x  4
5  bar  one  y  1

In [148]:
df.pivot_table(values="D", index=["A", "B"], columns="C")

C          x    y
A   B
bar one  4.0  1.0
    two  NaN  5.0
foo one  1.0  3.0
    two  2.0  NaN

# Data Input and Output

In [149]:
pwd

'/Users/migle/Desktop/Python_ML_Learning /UDEMY COURSE'

In [156]:
df = pd.read_csv("example")
df

    a   b   c   d
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15

In [157]:
# to save df to a csv file
# set index = False, to not include index as a separate column 
df.to_csv("new_csv", index = False)

In [ ]:
# to read in a df from a specific sheet name 
pd.read_excel("Excel_Sample.xlsx", sheetname = "Sheet1")

In [ ]:
# to read in from an html
data = pd.read_html("PASTE THE HTML LINK")
# requires certain libraries to be installed 

data[0] # the first table in the list of tables within html code